dwijaybane/msp430/Source Files/timer_b.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//timer_b.c - Driver for the TIMERB Module.
//
//*****************************************************************************
#include "inc/hw_types.h"
#include "debug.h"
#include "timer_b.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "deprecated/CCS/msp430xgeneric.h"
#endif

void privateTimerBProcessClockSourceDivider (unsigned int baseAddress,
    unsigned int clockSourceDivider);

//*****************************************************************************
//
//! Starts TimerB counter
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CONTINUOUS_MODE [Default value]
//!         \b TIMER_B_UPDOWN_MODE
//!         \b TIMER_B_UP_MODE

//! Modified register is \b TAxCTL
//!
//!NOTE: This function assumes that the timer has been previously configured
//! using TIMER_B_configureContinuousMode,  TIMER_B_configureUpMode or
//!TIMER_B_configureUpDownMode.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startCounter ( unsigned int baseAddress,
    unsigned int timerMode
    )
{
    ASSERT(
        (TIMER_B_UPDOWN_MODE == timerMode) ||
        (TIMER_B_CONTINUOUS_MODE == timerMode) ||
        (TIMER_B_UP_MODE == timerMode)
         );


    HWREG(baseAddress + OFS_TBxCTL) |= timerMode;
}

//*****************************************************************************
//
//! Configures TimerB in continuous mode.
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_B_CLOCKSOURCE_ACLK
//!         \b TIMER_B_CLOCKSOURCE_SMCLK
//!         \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TBIE is to enable or disable TimerB interrupt
//!        Valid values are
//!        \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default value]
//! \param timerClear decides if TimerB clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_B_DO_CLEAR
//!        \b TIMER_B_SKIP_CLEAR [Default value]
//!
//! Modified reister is \b TAxCTL
//!
//!This API does not start the timer. Timer needs to be started when required
//!using the TIMER_B_startCounter API.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_configureContinuousMode ( unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerInterruptEnable_TBIE,
    unsigned int timerClear
    )
{
    ASSERT(
        (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_B_DO_CLEAR == timerClear) ||
        (TIMER_B_SKIP_CLEAR == timerClear)
        );

    ASSERT(
        (TIMER_B_TBIE_INTERRUPT_ENABLE == timerInterruptEnable_TBIE) ||
        (TIMER_B_TBIE_INTERRUPT_DISABLE == timerInterruptEnable_TBIE)
        );

    ASSERT(
        (TIMER_B_CLOCKSOURCE_DIVIDER_1 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_2 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_4 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_8 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_3 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_5 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_6 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_7 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_10 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_12 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_14 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_16 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_20 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_24 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_28 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_32 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_40 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_48 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_56 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_64 == clockSourceDivider)
        );


    privateTimerBProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

