dwijaybane/msp430/Source Files/timer_b.c
    HWREG(baseAddress + OFS_TBxCTL) &=
        ~(TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
          TIMER_B_UPDOWN_MODE +
          TIMER_B_DO_CLEAR +
          TIMER_B_TBIE_INTERRUPT_ENABLE +
          CNTL_3
          );

    HWREG(baseAddress + OFS_TBxCTL)  |= ( clockSource +
    									  TIMER_B_STOP_MODE +
                                          timerClear +
                                          timerInterruptEnable_TBIE
                                          );
    if (TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE ==
        captureCompareInterruptEnable_CCR0_CCIE){
        HWREG(baseAddress + OFS_TBxCCTL0)  |= TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE;
    } else   {
        HWREG(baseAddress + OFS_TBxCCTL0)  &= ~TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE;
    }

    HWREG(baseAddress + OFS_TBxCCR0)  = timerPeriod;
}

//*****************************************************************************
//
//! DEPRPECATED - Replaced by TIMER_B_configureContinuousMode and TIMER_B_startCounter
//! API
//! Starts TimerB in continuous mode.
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_B_CLOCKSOURCE_ACLK
//!         \b TIMER_B_CLOCKSOURCE_SMCLK
//!         \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TBIE is to enable or disable TimerB interrupt
//!        Valid values are
//!        \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default value]
//! \param timerClear decides if TimerB clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_B_DO_CLEAR
//!        \b TIMER_B_SKIP_CLEAR [Default value]
//!
//! Modified reister is \b TAxCTL
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startContinuousMode ( unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerInterruptEnable_TBIE,
    unsigned int timerClear
    )
{
    ASSERT(
        (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_B_DO_CLEAR == timerClear) ||
        (TIMER_B_SKIP_CLEAR == timerClear)
        );

    ASSERT(
        (TIMER_B_TBIE_INTERRUPT_ENABLE == timerInterruptEnable_TBIE) ||
        (TIMER_B_TBIE_INTERRUPT_DISABLE == timerInterruptEnable_TBIE)
        );

    ASSERT(
        (TIMER_B_CLOCKSOURCE_DIVIDER_1 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_2 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_4 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_8 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_3 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_5 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_6 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_7 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_10 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_12 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_14 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_16 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_20 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_24 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_28 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_32 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_40 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_48 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_56 == clockSourceDivider) ||
        (TIMER_B_CLOCKSOURCE_DIVIDER_64 == clockSourceDivider)
        );


    privateTimerBProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

    HWREG(baseAddress +
        OFS_TBxCTL) &= ~(TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
                         TIMER_B_UPDOWN_MODE +
                         TIMER_B_DO_CLEAR +
                         TIMER_B_TBIE_INTERRUPT_ENABLE +
                         CNTL_3
                         );

    HWREG(baseAddress + OFS_TBxCTL)  |= ( clockSource + TIMER_B_CONTINUOUS_MODE +
                                          timerClear +
                                          timerInterruptEnable_TBIE);
}

//*****************************************************************************
//
//! DEPRECATED- Spelling Error Fixed
//! Starts TimerB in continuous mode.
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_B_CLOCKSOURCE_ACLK
//!         \b TIMER_B_CLOCKSOURCE_SMCLK
//!         \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TBIE is to enable or disable TimerB interrupt
//!        Valid values are
//!        \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default value]
//! \param timerClear decides if TimerB clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_B_DO_CLEAR
//!        \b TIMER_B_SKIP_CLEAR [Default value]
//!
//! Modified register is \b TAxCTL
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startContinousMode ( unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerInterruptEnable_TBIE,
    unsigned int timerClear
    )
{
	TIMER_B_startContinuousMode (baseAddress,
    clockSource,
    clockSourceDivider,
    timerInterruptEnable_TBIE,
    timerClear
    );
}
//*****************************************************************************
//
//! DEPRPECATED - Replaced by TIMER_B_configureUpMode and TIMER_B_startCounter  API
//!
//! Starts TimerB in up mode.
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_B_CLOCKSOURCE_ACLK
//!         \b TIMER_B_CLOCKSOURCE_SMCLK
//!         \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod is the specified TimerB period. This is the value that gets
//!         written into the CCR0. Limited to 16 bits[unsigned int]
//! \param timerInterruptEnable_TBIE is to enable or disable TimerB interrupt
//!        Valid values are
//!        \b TIMER_B_TBIE_INTERRUPT_ENABLE and
//!        \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default value]
//! \param captureCompareInterruptEnable_CCR0_CCIE is to enable or disable
//!         TimerB CCR0 captureComapre interrupt. Valid values are
//!        \b TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE and
//!        \b TIMER_B_CCIE_CCR0_INTERRUPT_DISABLE [Default value]
//! \param timerClear decides if TimerB clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_B_DO_CLEAR
//!        \b TIMER_B_SKIP_CLEAR [Default value]
//!
//! Modified registers are  \b TAxCTL, \b TAxCCR0, \b TAxCCTL0
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startUpMode (   unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerPeriod,
    unsigned int timerInterruptEnable_TBIE,
    unsigned int captureCompareInterruptEnable_CCR0_CCIE,
    unsigned int timerClear
    )
{
    ASSERT(
        (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_B_DO_CLEAR == timerClear) ||
        (TIMER_B_SKIP_CLEAR == timerClear)
        );

    ASSERT(
        (TIMER_B_DO_CLEAR == timerClear) ||
        (TIMER_B_SKIP_CLEAR == timerClear)
        );

    privateTimerBProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

