dwijaybane/msp430/Source Files/timer_b.c
    ASSERT((TIMER_B_CAPTUREMODE_NO_CAPTURE == captureMode) ||
        (TIMER_B_CAPTUREMODE_RISING_EDGE == captureMode) ||
        (TIMER_B_CAPTUREMODE_FALLING_EDGE == captureMode) ||
        (TIMER_B_CAPTUREMODE_RISING_AND_FALLING_EDGE == captureMode)
        );

    ASSERT((TIMER_B_CAPTURE_INPUTSELECT_CCIxA == captureInputSelect) ||
        (TIMER_B_CAPTURE_INPUTSELECT_CCIxB == captureInputSelect) ||
        (TIMER_B_CAPTURE_INPUTSELECT_GND == captureInputSelect) ||
        (TIMER_B_CAPTURE_INPUTSELECT_Vcc == captureInputSelect)
        );

    ASSERT((TIMER_B_CAPTURE_ASYNCHRONOUS == synchronizeCaptureSource) ||
        (TIMER_B_CAPTURE_SYNCHRONOUS == synchronizeCaptureSource)
        );

    ASSERT(
        (TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE == captureInterruptEnable) ||
        (TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE == captureInterruptEnable)
        );

    ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_RESET == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET_RESET == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_SET == captureOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET_SET == captureOutputMode)
        );

    if (TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureRegister){
        //CaptureCompare register 0 only supports certain modes
        ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE == captureOutputMode) ||
            (TIMER_B_OUTPUTMODE_SET == captureOutputMode) ||
            (TIMER_B_OUTPUTMODE_TOGGLE == captureOutputMode) ||
            (TIMER_B_OUTPUTMODE_RESET == captureOutputMode)
            );
    }

    HWREG(baseAddress + captureRegister ) |=   CAP;

    HWREG(baseAddress + captureRegister) &=
        ~(TIMER_B_CAPTUREMODE_RISING_AND_FALLING_EDGE +
          TIMER_B_CAPTURE_INPUTSELECT_Vcc +
          TIMER_B_CAPTURE_SYNCHRONOUS +
          TIMER_B_DO_CLEAR +
          TIMER_B_TBIE_INTERRUPT_ENABLE +
          CM_3
          );

    HWREG(baseAddress + captureRegister)  |= (captureMode +
                                              captureInputSelect +
                                              synchronizeCaptureSource +
                                              captureInterruptEnable +
                                              captureOutputMode
                                              );
}

//*****************************************************************************
//
//! Initializes Compare Mode
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareInterruptEnable is to enable or disable
//!         TimerB captureComapre interrupt. Valid values are
//!        \b TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE and
//!        \b TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE [Default value]
//! \param compareOutputMode specifies the ouput mode. Valid values are
//!        \b TIMER_B_OUTPUTMODE_OUTBITVALUE [Default value],
//!        \b TIMER_B_OUTPUTMODE_SET,
//!        \b TIMER_B_OUTPUTMODE_TOGGLE_RESET,
//!        \b TIMER_B_OUTPUTMODE_SET_RESET
//!        \b TIMER_B_OUTPUTMODE_TOGGLE,
//!        \b TIMER_B_OUTPUTMODE_RESET,
//!        \b TIMER_B_OUTPUTMODE_TOGGLE_SET,
//!        \b TIMER_B_OUTPUTMODE_RESET_SET
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified register is \b TAxCCTLn and \b TAxCCRn
//! \return None
//
//*****************************************************************************
void TIMER_B_initCompare (  unsigned int baseAddress,
    unsigned int compareRegister,
    unsigned short compareInterruptEnable,
    unsigned int compareOutputMode,
    unsigned int compareValue
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == compareRegister)
        );

   ASSERT((TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE == compareInterruptEnable) ||
        (TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE == compareInterruptEnable)
        );

    ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_SET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET_SET == compareOutputMode)
        );

    if (TIMER_B_CAPTURECOMPARE_REGISTER_0 == compareRegister){
        //CaptureCompare register 0 only supports certain modes
        ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
            (TIMER_B_OUTPUTMODE_SET == compareOutputMode) ||
            (TIMER_B_OUTPUTMODE_TOGGLE == compareOutputMode) ||
            (TIMER_B_OUTPUTMODE_RESET == compareOutputMode)
            );
    }


    HWREG(baseAddress + compareRegister ) &=   ~CAP;

