dwijaybane/msp430/Source Files/timer_b.c
    HWREG(baseAddress + compareRegister) &=
        ~(TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE +
          TIMER_B_OUTPUTMODE_RESET_SET
          );

    HWREG(baseAddress + compareRegister)  |= ( compareInterruptEnable +
                                               compareOutputMode
                                               );

    HWREG(baseAddress + compareRegister + OFS_TBxR) = compareValue;
}

//*****************************************************************************
//
//! Enable TimerB interrupt
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! Modified register is TAxCTL
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_enableInterrupt (unsigned int baseAddress)
{
    HWREGB(baseAddress + OFS_TBxCTL) &=  ~TBIFG;
    HWREG(baseAddress + OFS_TBxCTL) |= TBIE;
}

//*****************************************************************************
//
//! Disable TimerB interrupt
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! Modified register is \b TAxCTL
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_disableInterrupt (unsigned int baseAddress)
{
    HWREG(baseAddress + OFS_TBxCTL) &= ~TBIE;
}

//*****************************************************************************
//
//! Get TimerB interrupt status
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! \return unsigned long. Return interrupt status. Valid values are
//!         \b TIMER_B_INTERRUPT_PENDING
//!         \b TIMER_B_INTERRUPT_NOT_PENDING
//
//*****************************************************************************
unsigned long TIMER_B_getInterruptStatus (unsigned int baseAddress)
{
    return ( HWREG(baseAddress + OFS_TBxCTL) & TBIFG );
}

//*****************************************************************************
//
//! Enable capture compare interrupt
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureCompareRegister is the selected capture compare regsiter
//!
//! Modified register is \b TAxCCTLn
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_enableCaptureCompareInterrupt (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    HWREGB(baseAddress + captureCompareRegister) &= ~CCIFG;
    HWREG(baseAddress + captureCompareRegister) |= CCIE;
}

//*****************************************************************************
//
//! Disable capture compare interrupt
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureCompareRegister is the selected capture compare regsiter
//!
//! Modified register is \b TAxCCTLn
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_disableCaptureCompareInterrupt (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );
    HWREG(baseAddress + captureCompareRegister) &= ~CCIE;
}

//*****************************************************************************
//
//! Return capture compare interrupt status
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param mask is the mask for the interrupt status
//!         Valid values is and OR of
//!         \b TIMER_B_CAPTURE_OVERFLOW,
//!         \b TIMER_B_CAPTURECOMPARE_INTERRUPT_FLAG
//!
//!
//! \returns unsigned long. The mask of the set flags.
//
//*****************************************************************************
unsigned long TIMER_B_getCaptureCompareInterruptStatus (unsigned int baseAddress,
		 unsigned int captureCompareRegister,
		 unsigned int mask
		 )
{
    return ( HWREG(baseAddress + captureCompareRegister) & mask );
}

//*****************************************************************************
//
//! Reset/Clear the TimerB clock divider, count direction, count
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! Modified register is \b TAxCTL
//!
//! \returns None
//
//*****************************************************************************
void TIMER_B_clear (unsigned int baseAddress)
{
    HWREG(baseAddress + OFS_TBxCTL) |= TBCLR;
}

//*****************************************************************************
//
//! Get synchrnozied capturecompare input
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param synchronized is to select type of capture compare input.
//!         Valid values are
//!        \b TIMER_B_READ_CAPTURE_COMPARE_INPUT
//!        \b TIMER_B_READ_SYNCHRONIZED_CAPTURECOMPAREINPUT
//!
//! \return \b TIMER_B_CAPTURECOMPARE_INPUT_HIGH or
//!         \b TIMER_B_CAPTURECOMPARE_INPUT_LOW
//
//*****************************************************************************
unsigned short TIMER_B_getSynchronizedCaptureCompareInput
    (unsigned int baseAddress,
    unsigned int captureCompareRegister,
    unsigned short synchronized
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    ASSERT((TIMER_B_READ_CAPTURE_COMPARE_INPUT == synchronized) ||
        (TIMER_B_READ_SYNCHRONIZED_CAPTURECOMPAREINPUT == synchronized)
        );

    if (HWREG(baseAddress + captureCompareRegister) & synchronized){
        return ( TIMER_B_CAPTURECOMPARE_INPUT_HIGH) ;
    } else   {
        return ( TIMER_B_CAPTURECOMPARE_INPUT_LOW) ;
    }
}

//*****************************************************************************
//
//! Get ouput bit for output mode
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! \return \b TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH or
//!         \b TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW
//
//*****************************************************************************
unsigned char TIMER_B_getOutputForOutputModeOutBitValue
    (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    if (HWREG(baseAddress + captureCompareRegister) & OUT){
        return ( TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH) ;
    } else   {
        return ( TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW) ;
    }
}

//*****************************************************************************
//
//! Get current capturecompare count
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! \return current count as unsigned int
//
//*****************************************************************************
unsigned int TIMER_B_getCaptureCompareCount
    (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    return  (HWREG(baseAddress + OFS_TBxR + captureCompareRegister));
}

//*****************************************************************************
//
//! Set ouput bit for output mode
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureCompareRegister selects the Capture register being used.
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param outputModeOutBitValueis the value to be set for out bit
//!     Valid values are \b TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH
//!                      \b TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW
//!
//! Modified register is \b TAxCCTLn
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_setOutputForOutputModeOutBitValue
    (unsigned int baseAddress,
    unsigned int captureCompareRegister,
    unsigned char outputModeOutBitValue
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH == outputModeOutBitValue) ||
        (TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW == outputModeOutBitValue)
        );

    HWREG(baseAddress + captureCompareRegister) &= ~OUT;
    HWREG(baseAddress + captureCompareRegister) |= outputModeOutBitValue;
}

//*****************************************************************************
//
//! Generate a PWM with TimerB running in up mode
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK
//!         \b TIMER_B_CLOCKSOURCE_ACLK
//!         \b TIMER_B_CLOCKSOURCE_SMCLK
//!         \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_1
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod selects the desired TimerB period
//! \param compareRegister selects the compare register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareOutputMode specifies the ouput mode. Valid values are
//!        \b TIMER_B_OUTPUTMODE_OUTBITVALUE,
//!        \b TIMER_B_OUTPUTMODE_SET,
//!        \b TIMER_B_OUTPUTMODE_TOGGLE_RESET,
//!        \b TIMER_B_OUTPUTMODE_SET_RESET
//!        \b TIMER_B_OUTPUTMODE_TOGGLE,
//!        \b TIMER_B_OUTPUTMODE_RESET,
//!        \b TIMER_B_OUTPUTMODE_TOGGLE_SET,
//!        \b TIMER_B_OUTPUTMODE_RESET_SET
//! \param dutyCycle specifies the dutycycle for the generated waveform
//!
//! Modified registers are \b TAxCTL, \b TAxCCR0, \b TAxCCTL0,\b TAxCCTLn
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_generatePWM (  unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerPeriod,
    unsigned int compareRegister,
    unsigned int compareOutputMode,
    unsigned int dutyCycle
    )
{
    ASSERT(
        (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == compareRegister)
        );


    ASSERT((TIMER_B_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_SET_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_TOGGLE_SET == compareOutputMode) ||
        (TIMER_B_OUTPUTMODE_RESET_SET == compareOutputMode)
        );

    privateTimerBProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

    HWREG(baseAddress + OFS_TBxCTL)  &=
        ~( TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
           TIMER_B_UPDOWN_MODE + TIMER_B_DO_CLEAR +
           TIMER_B_TBIE_INTERRUPT_ENABLE
           );

    HWREG(baseAddress + OFS_TBxCTL)  |= ( clockSource +
                                          TIMER_B_UP_MODE +
                                          TIMER_B_DO_CLEAR
                                          );

    HWREG(baseAddress + OFS_TBxCCR0)  = timerPeriod;

    HWREG(baseAddress + OFS_TBxCCTL0)  &=
        ~(TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE +
          TIMER_B_OUTPUTMODE_RESET_SET
          );
    HWREG(baseAddress + compareRegister)  |= compareOutputMode;

    HWREG(baseAddress + compareRegister + OFS_TBxR) = dutyCycle;
}

//*****************************************************************************
//
//! Stops the TimerB
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! Modified registers are \b TAxCTL
//!
//! \returns None
//
//*****************************************************************************
void TIMER_B_stop ( unsigned int baseAddress )
{
    HWREG(baseAddress + OFS_TBxCTL)  &= ~MC_3;
    HWREG(baseAddress + OFS_TBxCTL)  |= MC_0;
}

//*****************************************************************************
//
//! Private clock source divider helper function
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param clockSourceDivider is the desired divider for the clock source
//!
//! Modified registers are TAxEX0, TAxCTL
//!
//! \returns None
//
//*****************************************************************************
void privateTimerBProcessClockSourceDivider (unsigned int baseAddress,
    unsigned int clockSourceDivider)
{
    HWREG(baseAddress + OFS_TBxCTL) &= ~ID__8;
    HWREG(baseAddress + OFS_TBxEX0) &= ~TBIDEX_7;
    switch (clockSourceDivider){
        case TIMER_B_CLOCKSOURCE_DIVIDER_1:
        case TIMER_B_CLOCKSOURCE_DIVIDER_2:
        case TIMER_B_CLOCKSOURCE_DIVIDER_4:
        case TIMER_B_CLOCKSOURCE_DIVIDER_8:
            HWREG(baseAddress + OFS_TBxCTL) |= ((clockSourceDivider - 1) << 6);
            HWREG(baseAddress + OFS_TBxEX0) = TBIDEX_0;
            break;

        case TIMER_B_CLOCKSOURCE_DIVIDER_3:
        case TIMER_B_CLOCKSOURCE_DIVIDER_5:
        case TIMER_B_CLOCKSOURCE_DIVIDER_6:
        case TIMER_B_CLOCKSOURCE_DIVIDER_7:
            HWREG(baseAddress + OFS_TBxCTL) |= ID__1;
            HWREG(baseAddress + OFS_TBxEX0) = (clockSourceDivider - 1);
            break;

        case TIMER_B_CLOCKSOURCE_DIVIDER_10:
        case TIMER_B_CLOCKSOURCE_DIVIDER_12:
        case TIMER_B_CLOCKSOURCE_DIVIDER_14:
        case TIMER_B_CLOCKSOURCE_DIVIDER_16:
            HWREG(baseAddress + OFS_TBxCTL) |= ID__2;
            HWREG(baseAddress + OFS_TBxEX0) = (clockSourceDivider / 2 - 1 );
            break;

        case TIMER_B_CLOCKSOURCE_DIVIDER_20:
        case TIMER_B_CLOCKSOURCE_DIVIDER_24:
        case TIMER_B_CLOCKSOURCE_DIVIDER_28:
        case TIMER_B_CLOCKSOURCE_DIVIDER_32:
            HWREG(baseAddress + OFS_TBxCTL) |= ID__4;
            HWREG(baseAddress + OFS_TBxEX0) = (clockSourceDivider / 4 - 1);
            break;
        case TIMER_B_CLOCKSOURCE_DIVIDER_40:
        case TIMER_B_CLOCKSOURCE_DIVIDER_48:
        case TIMER_B_CLOCKSOURCE_DIVIDER_56:
        case TIMER_B_CLOCKSOURCE_DIVIDER_64:
            HWREG(baseAddress + OFS_TBxCTL) |= ID__8;
            HWREG(baseAddress + OFS_TBxEX0) = (clockSourceDivider / 8 - 1);
            break;
    }
}

//*****************************************************************************
//
//! Sets the value of the capture-compare register
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param compareRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified register is \b TAxCCRn
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_setCompareValue (  unsigned int baseAddress,
    unsigned int compareRegister,
    unsigned int compareValue
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == compareRegister)
        );

    HWREG(baseAddress + compareRegister + OFS_TBxR) = compareValue;
}

//*****************************************************************************
//
//! Clears the TimerB TBIFG interrupt flag
//!
//! \param baseAddress is the base address of the TimerB module.
//!
//! Modified bits are TBIFG of TAxCTL register
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_clearTimerInterruptFlag (unsigned int baseAddress)
{
    HWREG(baseAddress + OFS_TBxCTL) &= ~TBIFG;
}

