dwijaybane/msp430/Source Files/timer_b.c
//*****************************************************************************
//
//! Clears the capture-compare interrupt flag
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param captureCompareRegister selects the Capture-compare register being
//! used. Valid values are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! Modified bits are CCIFG of \b TAxCCTLn register
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_clearCaptureCompareInterruptFlag (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    HWREG(baseAddress + captureCompareRegister)  &= ~CCIFG;
}

//*****************************************************************************
//
//! Selects TimerB counter length
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param counterLength selects the value of counter length.
//! Valid values are
//!     \b TIMER_B_COUNTER_16BIT [Default value]
//!     \b TIMER_B_COUNTER_12BIT
//!     \b TIMER_B_COUNTER_10BIT
//!     \b TIMER_B_COUNTER_8BIT
//!
//! Modified bits are CNTL of \b TBxCTL register
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_selectCounterLength (unsigned int  baseAddress,
		unsigned int counterLength
		)
{
	ASSERT((TIMER_B_COUNTER_8BIT == counterLength) ||
	        (TIMER_B_COUNTER_10BIT == counterLength) ||
	        (TIMER_B_COUNTER_12BIT == counterLength) ||
	        (TIMER_B_COUNTER_16BIT == counterLength)
	        );


	HWREG(baseAddress + OFS_TBxCTL) &= ~CNTL_3;
	HWREG(baseAddress + OFS_TBxCTL) |= counterLength;
}
//*****************************************************************************
//
//! Selects TimerB Latching Group
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param groupLatch selects the value of counter length.
//! Valid values are
//!     \b TIMER_B_GROUP_NONE [Default value]
//!     \b TIMER_B_GROUP_CL12_CL23_CL56
//!     \b TIMER_B_GROUP_CL123_CL456
//!     \b TIMER_B_GROUP_ALL
//!
//! Modified bits are TBCLGRP of \b TBxCTL register
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_selectLatchingGroup(unsigned int  baseAddress,
		unsigned int  groupLatch)
{
	ASSERT((TIMER_B_GROUP_NONE  == groupLatch) ||
		   (TIMER_B_GROUP_CL12_CL23_CL56 == groupLatch) ||
		   (TIMER_B_GROUP_CL123_CL456 == groupLatch) ||
		   (TIMER_B_GROUP_ALL == groupLatch)
		   );


	HWREG(baseAddress + OFS_TBxCTL) &= ~TBCLGRP_3;
	HWREG(baseAddress + OFS_TBxCTL) |= groupLatch;
}
//*****************************************************************************
//
//! Selects Compare Latch Load Event
//!
//! \param baseAddress is the base address of the TimerB module.
//! \param compareRegister selects the Capture-compare register being
//! used. Valid values are
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareLatchLoadEvent selects the latch load event
//! Valid values are
//!     \b TIMER_B_LATCH_ON_WRITE_TO_TBxCCRn_COMPARE_REGISTER [Default value]
//!     \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE
//!     \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE
//!     \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE
//!
//! Modified bits are CLLD of \b TBxCCTLn register
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initCompareLatchLoadEvent(unsigned int  baseAddress,
		unsigned int  compareRegister,
		unsigned int  compareLatchLoadEvent
		)
{
	ASSERT((TIMER_B_LATCH_ON_WRITE_TO_TBxCCRn_COMPARE_REGISTER  == compareLatchLoadEvent) ||
		(TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE == compareLatchLoadEvent) ||
		(TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE == compareLatchLoadEvent) ||
		(TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE == compareLatchLoadEvent)
		);

	HWREG(baseAddress + compareRegister)  &= ~CLLD_3;
	HWREG(baseAddress + compareRegister)  |= compareLatchLoadEvent;
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
